JS-CS-Detection-byExample/Dataset (ALERT 5 GB)/374130/spot-1.2.5/spot-1.2.5/doc/userdoc/ltlfilt.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title><code>ltlfilt</code></title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="<code>ltlfilt</code>"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-08-21T17:43+0200"/>
<meta name="author" content="Alexandre Duret-Lutz"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="syntax.css" />
<link rel="stylesheet" type="text/css" href="http://spot.lip6.fr/css/spot-zenburn.css" />

</head>
<body>
<div id="org-div-home-and-up" style="text-align:center;white-space:nowrap;">
 <a accesskey="h" href="tools.html">UP</a> | <a accesskey="H" href="tools.html">HOME</a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title"><code>ltlfilt</code></h1>

<p>This tool is a filter for LTL formulas.  (It will also work with PSL
formulas.)  It can be used to perform a number of tasks.  Essentially:
</p><ul>
<li>converting formulas from one syntax to another,
</li>
<li>transforming formulas,
</li>
<li>selecting formulas matching some criterion.
</li>
</ul>



<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Changing syntaxes</a></li>
<li><a href="#sec-2">Altering the formula</a></li>
<li><a href="#sec-3">Filtering</a></li>
<li><a href="#sec-4">Using <code>--format</code></a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Changing syntaxes</h2>
<div class="outline-text-2" id="text-1">


<p>
Because it read and write formulas, <code>ltlfilt</code> accepts
all the <a href="ioltl.html">common input and output options</a>.
</p>
<p>
Additionally, if no <code>-f</code> or <code>-F</code> option is specified, <code>ltlfilt</code>
will read formulas from the standard input.
</p>
<p>
For instance the following will convert two LTL formulas expressed
using infix notation (with different names supported for the same
operators) and convert it into LBT's syntax.
</p>



<pre class="src src-sh">ltlfilt -l -f <span class="org-string">'p1 U (p2 &amp; GFp3)'</span> -f <span class="org-string">'X&lt;&gt;[]p4'</span>
</pre>

<pre class="example">
U p1 &amp; p2 G F p3
X F G p4
</pre>


<p>
Conversely, here is how to rewrite formulas expressed using the
LBT's Polish notation.  Let's take the following four formulas
taken from examples distributed with <code>scheck</code>:
</p>


<pre class="src src-sh">cat &gt;scheck.ltl&lt;&lt;EOF
<span class="org-sh-heredoc">! | G p0 &amp; G p1 F p3</span>
<span class="org-sh-heredoc">| | X p7 F p6 &amp; | | t p3 p7 U | f p3 p3</span>
<span class="org-sh-heredoc">&amp; U &amp; X p0 X p4 F p1 X X U X F p5 U p0 X X p3</span>
<span class="org-sh-heredoc">U p0 &amp; | p0 p5 p1</span>
<span class="org-sh-heredoc">EOF</span>
</pre>


<p>
These can be turned into something easier to read (to the human) with:
</p>


<pre class="src src-sh">ltlfilt --lbt-input -F scheck.ltl
</pre>

<pre class="example">
!(Gp0 | (Gp1 &amp; Fp3))
p3 | Xp7 | Fp6
((Xp0 &amp; Xp4) U Fp1) &amp; XX(XFp5 U (p0 U XXp3))
p0 U (p1 &amp; (p0 | p5))
</pre>


</div>

</div>
