JS-CS-Detection-byExample/Dataset (ALERT 5 GB)/374130/spot-1.2.5/spot-1.2.5/doc/userdoc/ltlfilt.html

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Altering the formula</h2>
<div class="outline-text-2" id="text-2">


<p>
As with <a href="randltl.html"><code>randltl</code></a>, the <code>-r</code> option can be used to simplify formulas.
</p>



<pre class="src src-sh">ltlfilt --lbt-input -F scheck.ltl -r
</pre>

<pre class="example">
F!p0 &amp; (F!p1 | G!p3)
p3 | Xp7 | Fp6
Fp1 &amp; XX(XFp5 U (p0 U XXp3))
p0 U (p1 &amp; (p0 | p5))
</pre>


<p>
You may notice that operands of n-ary operators such as <code>&amp;</code> or <code>|</code> can
be reordered by <code>ltlfilt</code> even when the formula is not changed
otherwise.  This is because Spot internally order all operands of
commutative and associative operators, and that this order depends on
the order in which the subformulas are first encountered.  Adding
transformation options such as <code>-r</code> may alter this order.  However
this difference is semantically insignificant.
</p>
<p>
Formulas can be easily negated using the <code>-n</code> option, rewritten into
negative normal form using the <code>--nnf</code> option, and the <code>W</code> and <code>M</code>
operators can be rewritten using <code>U</code> and <code>R</code> using the <code>--remove-wm</code>
option (note that this is already done when a formula is output in
Spin's syntax).
</p>
<p>
Another way to alter formula is to rename the atomic propositions it
uses.  The <code>--relabel=abc</code> will relabel all atomic propositions using
letters of the alphabet, while <code>--relabel=pnn</code> will use <code>p0</code>, <code>p1</code>,
etc. as in LBT's syntax.
</p>



<pre class="src src-sh">ltlfilt --lbt-input -F scheck.ltl -r --relabel=abc
</pre>

<pre class="example">
F!a &amp; (F!b | G!c)
a | Xb | Fc
Fa &amp; XX(XFb U (c U XXd))
a U (b &amp; (a | c))
</pre>


<p>
Note that the relabeling is reset between each formula: <code>p3</code> became
<code>c</code> in the first formula, but it became <code>d</code> in the third.
</p>
<p>
Another use of relabeling is to get rid of complex atomic propositions
such as the one shown when <a href="ioltl.html">presenting lenient mode</a>:
</p>



<pre class="src src-sh">ltlfilt --lenient --relabel=pnn -f <span class="org-string">'(a &lt; b) U (process[2]@ok)'</span>
</pre>

<pre class="example">
p0 U p1
</pre>



<p>
Finally, there is a second variant of the relabeling procedure that is
enabled by <code>--relabel-bool=abc</code> or <code>--relabel-book=pnn</code>.  With this
option, Boolean subformulas that do not interfere with other
subformulas will be changed into atomic propositions.  For instance:
</p>



<pre class="src src-sh">ltlfilt -f <span class="org-string">'(a &amp; !b) &amp; GF(a &amp; !b) &amp; FG(!c)'</span> --relabel-bool=pnn
ltlfilt -f <span class="org-string">'(a &amp; !b) &amp; GF(a &amp; !b) &amp; FG(!c &amp; a)'</span> --relabel-bool=pnn
</pre>

<pre class="example">
p0 &amp; GFp0 &amp; FGp1
p0 &amp; p1 &amp; GF(p0 &amp; p1) &amp; FG(p0 &amp; p2)
</pre>


<p>
In the first formula, the independent <code>a &amp; !b</code> and <code>!c</code> subformulae
were respectively renamed <code>p0</code> and <code>p1</code>.  In the second formula, <code>a &amp; !b</code> and <code>!c &amp; a</code> are dependent so they could not be renamed; instead
<code>a</code>, <code>!b</code> and <code>c</code> were renamed as <code>p0</code>, <code>p1</code> and <code>p2</code>.
</p>
<p>
This option was originally developed to remove superfluous formulas
from benchmarks of LTL translators.  For instance the automata
generated for <code>GF(a|b)</code> and <code>GF(p0)</code> should be structurally
equivalent: replacing <code>p0</code> by <code>a|b</code> in the second automaton should
turn in into the first automaton, and vice-versa.  (However algorithms
dealing with <code>GF(a|b)</code> might be slower because they have to deal with
more atomic propositions.)  So given a long list of LTL formulas, we
can combine <code>--relabel-bool</code> and <code>-u</code> to keep only one instance of
formulas that are equivalent after such relabeling.  We also suggest
to use <code>--nnf</code> so that <code>!FG(a -&gt; b)</code> would become <code>GF(p0)</code>
as well.  For instance here are some LTL formulas extracted from an
<a href="http://www.fi.muni.cz/~xrehak/publications/verificationresults.ps.gz">industrial project</a>:
</p>



<pre class="src src-sh">ltlfilt --nnf -u --relabel-bool &lt;&lt;EOF
<span class="org-sh-heredoc">G (hfe_rdy -&gt; F !hfe_req)</span>
<span class="org-sh-heredoc">G (lup_sr_valid -&gt; F lup_sr_clean )</span>
<span class="org-sh-heredoc">G F (hfe_req)</span>
<span class="org-sh-heredoc">reset &amp;&amp; X G (!reset)</span>
<span class="org-sh-heredoc">G ( (F hfe_clk) &amp;&amp; (F ! hfe_clk) )</span>
<span class="org-sh-heredoc">G ( (F lup_clk) &amp;&amp; (F ! lup_clk) )</span>
<span class="org-sh-heredoc">G F (lup_sr_clean)</span>
<span class="org-sh-heredoc">G ( ( !(lup_addr_5_ &lt;-&gt; (X lup_addr_5_)) || !(lup_addr_6_ &lt;-&gt; (X lup_addr_6_)) || !(lup_addr_7_ &lt;-&gt; (X lup_addr_7_)) || !(lup_addr_8_ &lt;-&gt; (X lup_addr_8_)) ) -&gt; ( (X !lup_sr_clean) &amp;&amp; X ( (!( !(lup_addr_5_ &lt;-&gt; (X lup_addr_5_)) || !(lup_addr_6_ &lt;-&gt; (X lup_addr_6_)) || !(lup_addr_7_ &lt;-&gt; (X lup_addr_7_)) || !(lup_addr_8_ &lt;-&gt; (X lup_addr_8_)) )) U lup_sr_clean ) ) )</span>
<span class="org-sh-heredoc">G F ( !(lup_addr_5_ &lt;-&gt; (X lup_addr_5_)) || !(lup_addr_6_ &lt;-&gt; (X lup_addr_6_)) || !(lup_addr_7_ &lt;-&gt; (X lup_addr_7_)) || !(lup_addr_8_ &lt;-&gt; (X lup_addr_8_)) )</span>
<span class="org-sh-heredoc">(lup_addr_8__5__eq_0)</span>
<span class="org-sh-heredoc">((hfe_block_0__eq_0)&amp;&amp;(hfe_block_1__eq_0)&amp;&amp;(hfe_block_2__eq_0)&amp;&amp;(hfe_block_3__eq_0))</span>
<span class="org-sh-heredoc">G ((lup_addr_8__5__eq_0) -&gt; X( (lup_addr_8__5__eq_0) || (lup_addr_8__5__eq_1) ) )</span>
<span class="org-sh-heredoc">G ((lup_addr_8__5__eq_1) -&gt; X( (lup_addr_8__5__eq_1) || (lup_addr_8__5__eq_2) ) )</span>
<span class="org-sh-heredoc">G ((lup_addr_8__5__eq_2) -&gt; X( (lup_addr_8__5__eq_2) || (lup_addr_8__5__eq_3) ) )</span>
<span class="org-sh-heredoc">G ((lup_addr_8__5__eq_3) -&gt; X( (lup_addr_8__5__eq_3) || (lup_addr_8__5__eq_4) ) )</span>
<span class="org-sh-heredoc">G ((lup_addr_8__5__eq_4) -&gt; X( (lup_addr_8__5__eq_4) || (lup_addr_8__5__eq_5) ) )</span>
<span class="org-sh-heredoc">G ((lup_addr_8__5__eq_5) -&gt; X( (lup_addr_8__5__eq_5) || (lup_addr_8__5__eq_6) ) )</span>
<span class="org-sh-heredoc">G ((lup_addr_8__5__eq_6) -&gt; X( (lup_addr_8__5__eq_6) || (lup_addr_8__5__eq_7) ) )</span>
<span class="org-sh-heredoc">G ((lup_addr_8__5__eq_7) -&gt; X( (lup_addr_8__5__eq_7) || (lup_addr_8__5__eq_8) ) )</span>
<span class="org-sh-heredoc">G ((lup_addr_8__5__eq_8) -&gt; X( (lup_addr_8__5__eq_8) || (lup_addr_8__5__eq_9) ) )</span>
<span class="org-sh-heredoc">G ((lup_addr_8__5__eq_9) -&gt; X( (lup_addr_8__5__eq_9) || (lup_addr_8__5__eq_10) ) )</span>
<span class="org-sh-heredoc">G ((lup_addr_8__5__eq_10) -&gt; X( (lup_addr_8__5__eq_10) || (lup_addr_8__5__eq_11) ) )</span>
<span class="org-sh-heredoc">G ((lup_addr_8__5__eq_11) -&gt; X( (lup_addr_8__5__eq_11) || (lup_addr_8__5__eq_12) ) )</span>
<span class="org-sh-heredoc">G ((lup_addr_8__5__eq_12) -&gt; X( (lup_addr_8__5__eq_12) || (lup_addr_8__5__eq_13) ) )</span>
<span class="org-sh-heredoc">G ((lup_addr_8__5__eq_13) -&gt; X( (lup_addr_8__5__eq_13) || (lup_addr_8__5__eq_14) ) )</span>
<span class="org-sh-heredoc">G ((lup_addr_8__5__eq_14) -&gt; X( (lup_addr_8__5__eq_14) || (lup_addr_8__5__eq_15) ) )</span>
<span class="org-sh-heredoc">G ((lup_addr_8__5__eq_15) -&gt; X( (lup_addr_8__5__eq_15) || (lup_addr_8__5__eq_0) ) )</span>
<span class="org-sh-heredoc">G (((X hfe_clk) -&gt; hfe_clk)-&gt;((hfe_req-&gt;X hfe_req)&amp;&amp;((!hfe_req) -&gt; (X !hfe_req))))</span>
<span class="org-sh-heredoc">G (((X lup_clk) -&gt; lup_clk)-&gt;((lup_sr_clean-&gt;X lup_sr_clean)&amp;&amp;((!lup_sr_clean) -&gt; (X !lup_sr_clean))))</span>
<span class="org-sh-heredoc">EOF</span>
</pre>

<pre class="example">
G(a | Fb)
GFa
a &amp; XG!a
G(Fa &amp; F!a)
G((((!a &amp; X!a) | (a &amp; Xa)) &amp; ((!b &amp; X!b) | (b &amp; Xb)) &amp; ((!c &amp; X!c) | (c &amp; Xc)) &amp; ((!d &amp; X!d) | (d &amp; Xd))) | (X!e &amp; X((((!a &amp; X!a) | (a &amp; Xa)) &amp; ((!b &amp; X!b) | (b &amp; Xb)) &amp; ((!c &amp; X!c) | (c &amp; Xc)) &amp; ((!d &amp; X!d) | (d &amp; Xd))) U e)))
GF((!a &amp; Xa) | (a &amp; X!a) | (!b &amp; Xb) | (b &amp; X!b) | (!c &amp; Xc) | (c &amp; X!c) | (!d &amp; Xd) | (d &amp; X!d))
a
G(!a | X(a | b))
G((!b &amp; Xb) | ((!a | Xa) &amp; (a | X!a)))
</pre>


<p>
Here 29 formulas were reduced into 9 formulas after relabeling of
Boolean subexpression and removing of duplicate formulas.  In other
words the original set of formulas contains 9 different patterns.
</p>
</div>

</div>
