JS-CS-Detection-byExample/Dataset (ALERT 5 GB)/374130/spot-1.2.5/spot-1.2.5/doc/userdoc/ltlfilt.html

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">Filtering</h2>
<div class="outline-text-2" id="text-3">


<p>
<code>ltlfilt</code> supports many ways to filter formulas:
</p>




<pre class="example">    --boolean              match Boolean formulas
    --bsize-max=INT        match formulas with Boolean size &lt;= INT
    --bsize-min=INT        match formulas with Boolean size &gt;= INT
    --equivalent-to=FORMULA   match formulas equivalent to FORMULA
    --eventual             match pure eventualities
    --guarantee            match guarantee formulas (even pathological)
    --implied-by=FORMULA   match formulas implied by FORMULA
    --imply=FORMULA        match formulas implying FORMULA
    --ltl                  match only LTL formulas (no PSL operator)
    --nox                  match X-free formulas
    --obligation           match obligation formulas (even pathological)
    --safety               match safety formulas (even pathological)
    --size-max=INT         match formulas with size &lt;= INT
    --size-min=INT         match formulas with size &gt;= INT
    --stutter-insensitive, --stutter-invariant
                           match stutter-insensitive LTL formulas
    --syntactic-guarantee  match syntactic-guarantee formulas
    --syntactic-obligation match syntactic-obligation formulas
    --syntactic-persistence   match syntactic-persistence formulas
    --syntactic-recurrence match syntactic-recurrence formulas
    --syntactic-safety     match syntactic-safety formulas
    --universal            match purely universal formulas
-u, --unique               drop formulas that have already been output (not
                           affected by -v)
-v, --invert-match         select non-matching formulas
</pre>


<p>
Most of the above options should be self-explanatory.  For instance
the following command will extract all formulas from <code>scheck.ltl</code>
which do not represent guarantee properties.
</p>



<pre class="src src-sh">ltlfilt --lbt-input -F scheck.ltl -v --guarantee
</pre>

<pre class="example">
!(Gp0 | (Gp1 &amp; Fp3))
</pre>


<p>
Combining <code>ltlfilt</code> with <a href="randltl.html"><code>randltl</code></a> makes it easier to generate random
formulas that respect certain constraints.  For instance let us
generate 10 formulas that are equivalent to <code>a U b</code>:
</p>



<pre class="src src-sh">randltl -n -1 a b | ltlfilt --equivalent-to <span class="org-string">'a U b'</span> | head -n 10
</pre>


<pre class="example">a U b
b | (b W (Xb M a))
(a | Gb) U b
(a U b) &amp; Fb
((b &amp; F!a) U (a W (a W b))) U b
(a &amp; b) | (a U b)
b M (a U b)
(a U b) | Gb
Fb &amp; (a W b)
b | (XFb &amp; (Xb M a))
</pre>


<p>
The <code>-n -1</code> option to <code>randltl</code> will cause it to output an infinite
stream of random formulas.  <code>ltlfilt</code>, which reads its standard input
by default, will select only those equivalent to <code>a U b</code>.  The output
of <code>ltlfilt</code> would still be an infinite stream of random formulas, so
we display only the first 10 using the standard <code>head</code> utility.  Less
trivial formulas could be obtained by adding the <code>-r</code> option to
<code>randltl</code> (or equivalently adding the <code>-r</code> and <code>-u</code> option to
<code>ltlfilt</code>).
</p>

<p>
Another similar example, that requires two calls to <code>ltlfilt</code>, is the
generation of random pathological safety formulas.  Pathological
safety formulas are safety formulas that do not <i>look</i> so
syntactically.  We can generate some starting again with <code>randltl</code>,
then ignoring all syntactic safety formulas, and keeping only the
safety formulas in the remaining list.
</p>



<pre class="src src-sh">randltl -r -n -1 a b | ltlfilt -v --syntactic-safety | ltlfilt --safety | head -n 10
</pre>


<pre class="example">F(XF!b W Gb)
(((!a &amp; b) | (a &amp; !b)) U a) R ((!a &amp; X!a) | (a &amp; Xa))
F(b | G(!b &amp; X(!b W !a)))
G(!b &amp; Fb)
X(!a | ((a &amp; Fb) M b))
!a | XX!b | (a M Xa)
a | (a U Xb)
((!b &amp; Fa) | (b &amp; G!a)) R b
(b M a) U XXa
G((!a &amp; (a M b)) | (a &amp; (!a W !b)))
</pre>



<p>
<code>ltlfilt</code>'s filtering ability can also be used to answer questions
about a single formula.  For instance is <code>a U (b U a)</code> equivalent to
<code>b U a</code>?
</p>



<pre class="src src-sh">ltlfilt -f <span class="org-string">'a U (b U a)'</span> --equivalent-to <span class="org-string">'b U a'</span>
</pre>

<pre class="example">
a U (b U a)
</pre>


<p>
The command prints the formula and returns an exit status of 0 if the
two formulas are equivalent.  It would print nothing and set the exit
status to 1, were the two formulas not equivalent.
</p>

<p>
Is the formula <code>F(a &amp; X(!a &amp; Gb))</code> stutter-invariant?
</p>



<pre class="src src-sh">ltlfilt -f <span class="org-string">'F(a &amp; X(!a &amp; Gb))'</span> --stutter-invariant
</pre>

<pre class="example">
F(a &amp; X(!a &amp; Gb))
</pre>


<p>
Yes it is.  And since it is stutter-invariant, there exist some
equivalent formulas that do not use <code>X</code> operator.  The <code>--remove-x</code>
option gives one:
</p>



<pre class="src src-sh">ltlfilt -f <span class="org-string">'F(a &amp; X(!a &amp; Gb))'</span> --remove-x
</pre>

<pre class="example">
F(a &amp; ((a &amp; (a U (!a &amp; Gb)) &amp; ((!b U !a) | (b U !a))) | (!a &amp; (!a U (a &amp; !a &amp; Gb)) &amp; ((!b U a) | (b U a))) | (b &amp; (b U (!a &amp; !b &amp; Gb)) &amp; ((!a U !b) | (a U !b))) | (!b &amp; (!b U (!a &amp; b &amp; Gb)) &amp; ((!a U b) | (a U b))) | (!a &amp; Gb &amp; (G!a | Ga) &amp; (Gb | G!b))))
</pre>


<p>
We could even verify that the resulting horrible formula is equivalent
to the original one:
</p>



<pre class="src src-sh">ltlfilt -f <span class="org-string">'F(a &amp; X(!a &amp; Gb))'</span> --remove-x | ltlfilt --equivalent-to <span class="org-string">'F(a &amp; X(!a &amp; Gb))'</span>
</pre>

<pre class="example">
F(a &amp; ((a &amp; (a U (!a &amp; Gb)) &amp; ((!b U !a) | (b U !a))) | (!a &amp; (!a U (a &amp; !a &amp; Gb)) &amp; ((!b U a) | (b U a))) | (b &amp; (b U (!a &amp; !b &amp; Gb)) &amp; ((!a U !b) | (a U !b))) | (!b &amp; (!b U (!a &amp; b &amp; Gb)) &amp; ((!a U b) | (a U b))) | (!a &amp; Gb &amp; (G!a | Ga) &amp; (Gb | G!b))))
</pre>


<p>
It is therefore equivalent, but that is not a surprise since the
<code>--stutter-invariant</code> filter is actually implemented using exactly
<a href="http://homepages.inf.ed.ac.uk/kousha/note_on_stut_tl_lpi.ps">this procedure</a> (calling the <code>remove_x()</code> function, and building automata
to check the equivalence of the resulting formula with the original one).
</p>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">Using <code>--format</code></h2>
<div class="outline-text-2" id="text-4">


<p>
The <code>--format</code> option can be used the alter the way formulas are output (for instance use
<code>--latex --format='$%f$'</code>
to enclose formula in LaTeX format with <code>$...$</code>).  You may also find
<code>--format</code> useful in more complex scenarios.  For instance you could
print only the line numbers containing formulas matching some
criterion.  In the following, we print only the numbers of the lines
of <code>scheck.ltl</code> that contain guarantee formulas:
</p>



<pre class="src src-sh">ltlfilt --lbt-input -F scheck.ltl --guarantee --format=%L
</pre>

<pre class="example">
2
3
4
</pre>


<p>
<a href="csv.html">More examples of how to use <code>&ndash;format</code> to create CSV files are on a separate page</a>
</p>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2014-08-21T17:43+0200</p>
<p class="author">Author: Alexandre Duret-Lutz</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
